PlanarAcousticWave/common/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            leftBoundaryVelocityOscillations;
        code
        #{
            operator ==
                (
                    vector(1.0, 0.0, 0.0) *
                    0.01 *
                    Foam::sin(M_PI*2.0*this->db().time().value())
                );
        #};
    }
    right
    {
        type            zeroGradient;
    }
    "(empty1|empty2)"
    {
        type            empty;
    }
}

// ************************************************************************* //
